var data = [
  [
    "هو محمد بن عبد الله بن عبد المطلب بن هاشم بن عبد مناف بن قصي بن كلاب بن مرة بن كعب بن لؤي بن غالب بن فهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن معد بن عدنان. إلى ها هنا معلوم الصحة متفق عليه بين النسابين ولا خلاف فيه البتة، وما فوق عدنان مختلف فيه ولا خلاف بينهم أن عدنان من ولد إسماعيل عليه السلام",
    "ازاد المعاد - ابن القيم"
  ],
  [
    "أنا محمد وأحمد وأنا الماحي الذي يمحو الله بي الكفر, وأنا الحاشر الذي يحشر الناس على قدمي وأنا العاقب",
    "صحيح البخاري"
  ],
  [
    "زوجات النبي هن خديجة بنت خويلد, سودة بنت زمعة, عائشة بنت أبي بكر, حفصة بنت عمر, زينب بنت خزيمة, أم سلمة هند المخزومية, زينب بنت جحش, جويرية بنت الحارث, أم حبيبة, صفية, ميمونة رضي الله عنهن",
    ""
  ],
  [
    "أنجبت خديجة للنبي عبدالله, القاسم, زينب, رقية, أم كلثوم, فاطمة",
    "موسوعة الفقه الاسلامي"
  ],
  ["أنجب الرسول ابراهيم من جاريته مارية القبطية", "موسوعة الفقه الاسلامي"],
  [
    "تزوجت السيدة فاطمة من سيدنا علي بن أبي طالب وأنجبت الحسن والحسين رضي الله عنهم",
    "الأساس في السنة وفقهها"
  ],
  ["لقد كان لكم في رسول الله أسوة حسنة", "الأحزاب:21"],
  [
    "كان رسول الله صلى الله عليه وسلم أحسن الناس وجها وأحسنه خلقا ليس بالطويل البائن ولا بالقصير ",
    "صحيح البخاري"
  ],
  ["وانك لعلى خلق عظيم", "القلم:4"],
  ["أكمل المؤمنين ايمانا أحسنهم خلقا وخياركم خياركم لنسائكم", "سنن الترمذي"],
  [
    "قال الأقرع بن حابس يارسول الله ان لي عشرة من الولد ما قبلت انسانا منهم قط فنظر اليه رسول الله وقال من لا يرحم لا يرحم",
    "مسند أحمد"
  ],
  [
    "سأل رجل النبي يا رسول الله كم نعفو عن الخادم فصمت ثم أعاد عليه الكلام فصمت فلما كان في الثالثة قال اعفوا عنه كل يوم سبعين مرة",
    "هداية الرواة"
  ],
  [
    "أردت أن أعرف صفات الرجل الذى يملك بدون نزاع قلوب ملايين البشر.. لقد أصبحت مقتنعا كل الاقتناع أن السيف لم يكن الوسيلة التى من خلالها اكتسب الإسلام مكانته، بل كان ذلك من خلال بساطة الرسول مع دقته وصدقه فى الوعود، وتفانيه وإخلاصه لأصدقائه وأتباعه، وشجاعته مع ثقته المطلقة فى ربه وفى رسالته. هذه الصفات هى التى مهدت الطريق، وتخطت المصاعب وليس السيف. بعد انتهائى من قراءة الجزء الثانى من حياة الرسول وجدت نفسى آسفا لعدم وجود المزيد للتعرف أكثر على حياته العظيمة ",
    "الرسول في عيون غريبة منصفة"
  ],
  ["كان صلى الله عليه وسلم كلامه كلاما فصلا يفهمه كل من يسمعه", "سنن أبي داود"],
  ["كان صلى الله عليه وسلم أبغض الخلق اليه الكذب", "مسند أحمد"],
  [
    "كان صلى الله عليه وسلم اذا اطلع الي أحد من أهل بيته كذب كذبة, لم يزل معرضا عنه, حتى يحدث توبة",
    "مسند أحمد"
  ],
  ["كان صلى الله عليه وسلم لا يضحك الا تبسما", "سنن الترمذي"],
  ["كان صلى الله عليه وسلم أشد حياء من العذراء في خدرها", "متفق عليه"],
  ["كان صلى الله عليه وسلم يحدث حديثا لو أعده العاد لأحصاه", "متفق عليه"],
  [
    "كان صلى الله عليه وسلم اذا أتي بطعام سأل عنه أهدية أم صدقة؟ فان قيل صدقة قال لأصحابه كلوا ولم يأكل, وان قيل هدية ضرب بيده فأكل معهم",
    "صحيح مسلم"
  ],
  [
    "كان صلى الله عليه وسلم اذا أكل أو شرب قال الحمد لله الذي أطعم وسقى وسوغه وجعل له مخرجا",
    "سنن أبي داود"
  ],
  [
    "كان صلى الله عليه وسلم يأكل بثلاث أصابع ويلعق يده قبل أن يمسحها",
    "صحيح مسلم"
  ],
  [
    "كان صلى الله عليه وسلم يبيت الليالي المتتابعة طاويا وأهله لا يجدون عشاء وكان أكثر خبزهم خبز الشعير",
    "مسند أحمد"
  ],
];
